# ExtendToOthersWarn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..ExtendToOthersWarn Property
BuiltInFailures..::..EditingFailures Class See Also
---
Can't keep [Type Name] extended to [Type Name].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ExtendToOthersWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExtendToOthersWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ExtendToOthersWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace